docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-11 p 10:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Yemplate</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Gergely Szabo" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Yemplate</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ba4544">1. Introduction</a></li>
<li><a href="#org0cf0604">2. Use case</a>
<ul>
<li><a href="#org8f7be11">2.1. First approach</a></li>
<li><a href="#org080911d">2.2. Repeat with another git repo</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8ba4544" class="outline-2">
<h2 id="org8ba4544"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
We at <a href="https://origoss.com">origoss</a> love <a href="https://kubernetes.io">Kubernetes</a>. Sometimes we use our Kubernetes deployment to
run some <a href="https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/">batch jobs</a>.
</p>

<p>
Batch jobs are awesome but sometimes we find it a bit hard to work with.
</p>
</div>
</div>

<div id="outline-container-org0cf0604" class="outline-2">
<h2 id="org0cf0604"><span class="section-number-2">2</span> Use case</h2>
<div class="outline-text-2" id="text-2">
<p>
Let's see a bit convoluted use case where we want to copy a git repository to
a <a href="https://kubernetes.io/docs/concepts/storage/persistent-volumes/">persistent volume</a>.
</p>
</div>

<div id="outline-container-org8f7be11" class="outline-3">
<h3 id="org8f7be11"><span class="section-number-3">2.1</span> First approach</h3>
<div class="outline-text-3" id="text-2-1">
<p>
First, let's create a manifest file for our job that will mount two volumes
and perform the copy between the volumes.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>job1.yaml</label><pre class="src src-yaml" id="org16e0d96"><span style="color: #7590db;">apiVersion</span>: batch/v1
<span style="color: #7590db;">kind</span>: Job
<span style="color: #7590db;">metadata</span>:
  <span style="color: #7590db;">name</span>: git-copy-1
<span style="color: #7590db;">spec</span>:
  <span style="color: #7590db;">template</span>:
    <span style="color: #7590db;">spec</span>:
      <span style="color: #7590db;">containers</span>:
      - <span style="color: #7590db;">name</span>: git-copier
        <span style="color: #7590db;">image</span>: busybox
        <span style="color: #7590db;">volumeMounts</span>:
        - <span style="color: #7590db;">name</span>: gitrepo
          <span style="color: #7590db;">mountPath</span>: /git
        - <span style="color: #7590db;">name</span>: target
          <span style="color: #7590db;">mountPath</span>: /target
        <span style="color: #7590db;">command</span>:
        - sh
        - -c
        - |
          <span style="color: #2d9574;">rm -rf /target/*</span>
<span style="color: #2d9574;">          rm -rf /target/.*</span>
<span style="color: #2d9574;">          cp -a /git/* /target</span>
<span style="color: #2d9574;">          ls -a /target/*/*</span>
      <span style="color: #7590db;">restartPolicy</span>: Never
      <span style="color: #7590db;">volumes</span>:
      - <span style="color: #7590db;">name</span>: gitrepo
        <span style="color: #7590db;">gitRepo</span>:
          <span style="color: #7590db;">repository</span>: <span style="color: #2d9574;">'https://github.com/origoss/yemplate.git'</span>
      - <span style="color: #7590db;">name</span>: target
        <span style="color: #7590db;">persistentVolumeClaim</span>:
          <span style="color: #7590db;">claimName</span>: git-repo-target
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Starting job1</label><pre class="src src-bash">kubectl apply -f job1.yaml
</pre>
</div>

<pre class="example">
job.batch "git-copy-1" created

</pre>

<p>
After the job has been started, we can check the status with the <code>describe</code>
command.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Status of job1</label><pre class="src src-bash">kubectl describe job git-copy-1
</pre>
</div>

<pre class="example">
Name:           git-copy-1
Namespace:      default
Selector:       controller-uid=7769d70b-5431-11e8-b180-525400239935
Labels:         controller-uid=7769d70b-5431-11e8-b180-525400239935
                job-name=git-copy-1
Annotations:    kubectl.kubernetes.io/last-applied-configuration={"apiVersion":"batch/v1","kind":"Job","metadata":{"annotations":{},"name":"git-copy-1","namespace":"default"},"spec":{"template":{"spec":{"containers":...
Parallelism:    1
Completions:    1
Start Time:     Thu, 10 May 2018 11:06:46 +0200
Pods Statuses:  0 Running / 1 Succeeded / 0 Failed
Pod Template:
  Labels:  controller-uid=7769d70b-5431-11e8-b180-525400239935
           job-name=git-copy-1
  Containers:
   git-copier:
    Image:      busybox
    Port:       &lt;none&gt;
    Host Port:  &lt;none&gt;
    Command:
      sh
      -c
      rm -rf /target/*
rm -rf /target/.*
cp -a /git/* /target
ls -a /target/*/*

    Environment:  &lt;none&gt;
    Mounts:
      /git from gitrepo (rw)
      /target from target (rw)
  Volumes:
   gitrepo:
    Type:        GitRepo (a volume that is pulled from git when the pod is created)
    Repository:  https://github.com/origoss/yemplate.git
    Revision:    
   target:
    Type:       PersistentVolumeClaim (a reference to a PersistentVolumeClaim in the same namespace)
    ClaimName:  git-repo-target
    ReadOnly:   false
Events:
  Type    Reason            Age   From            Message
  ----    ------            ----  ----            -------
  Normal  SuccessfulCreate  14s   job-controller  Created pod: git-copy-1-bn5hd
</pre>

<p>
Let's check the logs generated by the pod.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Log of the pod created by job1</label><pre class="src src-bash">kubectl logs git-copy-1-bn5hd
</pre>
</div>

<pre class="example">
rm: can't remove '.' or '..'
rm: can't remove '.' or '..'
/target/yemplate/LICENSE
/target/yemplate/README.org
/target/yemplate/main.go

/target/yemplate/docs:
.
..
_config.yml
index.org
</pre>

<p>
Finally, we can remove the job.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Delete job1</label><pre class="src src-bash">kubectl delete job git-copy-1
</pre>
</div>

<pre class="example">
job.batch "git-copy-1" deleted

</pre>
</div>
</div>

<div id="outline-container-org080911d" class="outline-3">
<h3 id="org080911d"><span class="section-number-3">2.2</span> Repeat with another git repo</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We demonstrated, that it is relatively easy to start a job in Kubernetes.
What if we want to repeat the previous exercise using a slightly different
parameters, e.g. for a different git repository?
</p>

<p>
For jobs, the current standard solution is to create a new yaml file based on
the one shown in Listing <a href="#org16e0d96">1</a>.
</p>

<p>
If we perform such a task regularly this task cries for automation. If it was
a <a href="https://kubernetes.io/docs/concepts/workloads/controllers/deployment/">deployment</a>, we could use <a href="https://helm.sh/">helm</a> or some other available tool to create a
reusable template. 
</p>

<p>
Fortunately, for jobs, we can use the simple <a href="https://github.com/origoss/yemplate">yemplate</a> tool.
</p>

<p>
Let's create a job template based on the <a href="#org16e0d96">previous job manifest</a>.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>job1.yaml.t</label><pre class="src src-text" id="org4c85722"><span class="linenr"> 1: </span>apiVersion: batch/v1
<span class="linenr"> 2: </span>kind: Job
<span class="linenr"> 3: </span>metadata:
<span class="linenr"> 4: </span>  name: git-copy-1
<span class="linenr"> 5: </span>spec:
<span class="linenr"> 6: </span>  template:
<span class="linenr"> 7: </span>    spec:
<span class="linenr"> 8: </span>      containers:
<span class="linenr"> 9: </span>      - name: git-copier
<span class="linenr">10: </span>        image: busybox
<span class="linenr">11: </span>        volumeMounts:
<span class="linenr">12: </span>        - name: gitrepo
<span class="linenr">13: </span>          mountPath: /git
<span class="linenr">14: </span>        - name: target
<span class="linenr">15: </span>          mountPath: /target
<span class="linenr">16: </span>        command:
<span class="linenr">17: </span>        - sh
<span class="linenr">18: </span>        - -c
<span class="linenr">19: </span>        - |
<span class="linenr">20: </span>          rm -rf /target/*
<span class="linenr">21: </span>          rm -rf /target/.*
<span class="linenr">22: </span>          cp -a /git/* /target
<span class="linenr">23: </span>          ls -a /target/*/*
<span class="linenr">24: </span>      restartPolicy: Never
<span class="linenr">25: </span>      volumes:
<span class="linenr">26: </span>      - name: gitrepo
<span class="linenr">27: </span>        gitRepo:
<span class="linenr">28: </span>          repository: {{ .repository }}
<span class="linenr">29: </span>      - name: target
<span class="linenr">30: </span>        persistentVolumeClaim:
<span class="linenr">31: </span>          claimName: git-repo-target
</pre>
</div>

<p>
The only difference (besides the meaningless <code>.t</code> extension) is the
<code>repository</code> field that had been replaced with a template markup <code>{{
   .repository }}</code> in line 28.
</p>

<p>
We can use <code>yemplate</code> now to fill in the holes:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>Templating with yemplate</label><pre class="src src-bash">yemplate job1.yaml.t                                              <span style="color: #2d9574;">\</span>
         --set <span style="color: #7590db;">repository</span>=https://github.com/origoss/yemplate.git
</pre>
</div>

<pre class="example">
apiVersion: batch/v1
kind: Job
metadata:
  name: git-copy-1
spec:
  template:
    spec:
      containers:
      - name: git-copier
        image: busybox
        volumeMounts:
        - name: gitrepo
          mountPath: /git
        - name: target
          mountPath: /target
        command:
        - sh
        - -c
        - |
          rm -rf /target/*
          rm -rf /target/.*
          cp -a /git/* /target
          ls -a /target/*/*
      restartPolicy: Never
      volumes:
      - name: gitrepo
        gitRepo:
          repository: https://github.com/origoss/yemplate.git
      - name: target
        persistentVolumeClaim:
          claimName: git-repo-target
</pre>

<p>
As you can see, <code>yemplate</code> generated to the stdout a proper Kubernetes job
manifest file with the provided parameter in the value of the <code>repository</code>
field.
</p>

<p>
We can use this for creating our job:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>Starting templated job1</label><pre class="src src-bash">yemplate job1.yaml.t                                                <span style="color: #2d9574;">\</span>
         --set <span style="color: #7590db;">repository</span>=https://github.com/origoss/yemplate.git | <span style="color: #2d9574;">\</span>
    kubectl apply -f -
</pre>
</div>

<pre class="example">
job.batch "git-copy-1" created

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-05-10 cs 00:00</p>
<p class="author">Author: Gergely Szabo</p>
<p class="date">Created: 2018-05-11 p 10:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
